app/controllers/profiles_controller.rb

	def edit
		createNewLogEntry(request.request_uri)
		begin
			id = params[:id]
			@user = User.find(id)
---
SELECT * FROM "users" WHERE (author = '2' AND id != '2')

			end

			if @user.author != 0
				@author = User.find(@user.author)
---
SELECT * FROM "users" WHERE ("users"."author" = 1)

	def post_edit

		createNewLogEntry(request.request_uri)

		@user = User.find(params[:id])

 		prev = params[:user][:image_file]
		if (prev != nil)
			image_file = @user.id.to_s() + '_' + prev.original_filename
			new = Dir.getwd + "/images/pics/" + image_file
			create(prev, new)
			else
			image_file = @user.image_file
			end

 		@degrees = Degree.find(:all, :conditions => ["user_id = ?", @user.id])
		@degrees.each do |degree|
			degree.update_attributes(params[:user][:existing_degree_attributes][degree.id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "major" = 'AI', "email" = 'j@stanford.edu', "job_end1" = 'present', "six_words" = '', "name" = 'James Holt', "job_start1" = '09/1995', "company1" = 'NASA', "title1" = 'Senior Researcher', "summary" = 'Currently working on getting a new robot on Jupiter!', "stanford_class" = 1988, "satisfaction1" = 5, "updated_at" = '2010-02-04 19:17:21', "degree" = 'Undergraduate', "interview_text" = 'Q: What is the best part of the job?

	def view
		createNewLogEntry(request.request_uri)
		begin
			id = params[:id]
			@user = User.find(id)
		rescue
			redirect_to "/404.html"
		else

			if ($master.sign_in_to_view and session["#{$master.url}_id"] == nil)
				if (params[:id])
					signin_to_view "/profiles/view/#{params[:id]}"
				else
					signin_to_view "/profiles/about"
				end
				return
			end

			@admin_email = $master.admin_email

			@jobs = Job.find(:all, :conditions => ["user_id = ? AND (title != ? OR company != ?)", id, "", ""])
			@degrees = Degree.find(:all, :conditions => ["user_id = ? AND (degree != ? OR major != ?)", id, "", ""])

			if (session[:user_id] != @user.id && session[:user_id] != @user.author)
				@user.views = @user.views + 1
			end

			if @user.author != 0
				@author = User.find(@user.author)
---
SELECT * FROM "users" WHERE (author = '2' AND id != '2')
SELECT * FROM "users" WHERE ("users"."author" = 1) LIMIT 1


				@interviewees_approved = User.find(:all, :conditions => [ "author = ? AND id != ? AND approved = '1'", id, id])
				@interviewees_pending = User.find(:all, :conditions => [ "author = ? AND id != ? AND approved != '1'", id, id])
				@user.save
---
UPDATE "users" SET "updated_at" = '2010-01-28 06:15:25', "total_views" = 1 WHERE "id" = 3

	def post_like
		createNewLogEntry(request.request_uri)
		@user = User.find(params[:id])

		if (session[:user_id] != @user.id && session[:user_id] != @user.author)
			@user.views = @user.views - 1
			author = User.find(@user.author)
			author.total_views = author.total_views - 1
			author.save
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "views" = 18, "likes" = 7, "updated_at" = '2010-01-25 05:50:12' WHERE "id" = 1

	def post_question
		createNewLogEntry(request.request_uri)

		@user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

			@user.views = @user.views - 1
			author = User.find(@user.author)
			author.total_views = author.total_views - 1
			author.save
---
UPDATE "users" SET "views" = 2, "new_question" = 'Did having a symbolic systems background help you get this job? If so, what impact did it have?', "updated_at" = '2010-01-28 06:52:58', "interview_text" = 'Q: How did you find out about your job and why did you join?

	def search

		potential_interviewees = User.find(:all, :conditions => ["author = ?", 0])
		if (potential_interviewees != nil && potential_interviewees.length > 0)
---
SELECT * FROM "users" WHERE (date_modified > '2010-01-28 01:31:18' AND author != id) ORDER BY date_modified
SELECT count(*) AS count_all FROM "users"

			end
			@searchResults = searchResults.uniq.sort { |a, b| a.name <=> b.name}
		else
			@searchResults = User.find(:all, :conditions => ['author != ? and approved > ? and summary != ?', 0, 0, ""], :order => 'views DESC', :limit => 10)
---
SELECT * FROM "users" WHERE (date_modified > '2010-01-28 01:43:51' AND author != id) ORDER BY date_modified DESC LIMIT 5

			return
		end

		if @user.save
---
INSERT INTO "users" ("name", "company", "job_start", "image_file", "degree", "satisfaction", "six_words", "total_views", "updated_at", "title", "hashed_password", "interview_text", "author", "date_modified", "interview_date", "total_authored", "new_question", "stanford_class", "summary", "major", "job_end", "views", "date_added", "email", "keywords", "likes", "created_at") VALUES(NULL, NULL, NULL, 'blank_profile_pic.jpg', NULL, NULL, NULL, 0, '2010-02-04 09:36:16', NULL, NULL, '== Interview Form ==
UPDATE "users" SET "total_authored" = 1, "updated_at" = '2010-01-28 05:09:20' WHERE "id" = 1

			@degree = Degree.new
			@degree.user_id = @user[:id]
			@degree.save
			author = User.find(session["#{$master.url}_id"])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)