app/controllers/user_controller.rb

  def post_signin
  	flash[:notice] = nil
    @user = User.find_by_email(params[:user][:email])
---
SELECT * FROM "users" WHERE ("users"."email" = 'knigh@stanford.edu') LIMIT 1

  def post_register
    @user = User.new
    @user.name = params[:user][:name]
    @user.email = params[:user][:email]
    @password = params[:password]
    @password_confirmation = params[:password_confirmation]
    @user.alum_interview_text = $alum_interview
    @user.student_interview_text = $student_interview

	flash[:notice] = nil

	if @user.name.length < 1
---
SELECT * FROM "users" WHERE ("users"."email" = 'knigh@stanford.edu') LIMIT 1

		  render (:action => :signin)
    else
   	 	@user.hashed_password = Digest::SHA1.hexdigest(@password)
		if @user.save
---
INSERT INTO "users" ("name", "company", "job_start", "image_file", "degree", "satisfaction", "six_words", "total_views", "updated_at", "title", "hashed_password", "company1", "title1", "email_private", "interview_text", "author", "date_modified", "interview_date", "total_authored", "new_question", "stanford_class", "summary", "job_start1", "job_end1", "major", "job_end", "views", "date_added", "satisfaction1", "responsibilities1", "email", "keywords", "likes", "created_at") VALUES('James Colt', NULL, NULL, 'blank_profile_pic.jpg', NULL, NULL, NULL, 0, '2010-02-04 17:55:07', NULL, '5c2dd944dde9e08881bef0894fe7b22a5c9c4b06', NULL, NULL, NULL, '== Interview Form ==
UPDATE "users" SET "author" = 1, "updated_at" = '2010-01-28 04:24:19' WHERE "id" = 1